{
    "about-grids": {
        "heading": "Introduction",
        "description": [
            "CSS Grid Layout is the most powerful layout system available in CSS. It is a 2-dimensional system, meaning it can handle both columns and rows.",
            "You work with Grid Layout by applying CSS rules both to a parent element (which becomes the Grid Container) and to that elements children (which become Grid Items).",
            "CSS Grid Layout (aka 'Grid'), is a two-dimensional grid-based layout system that aims to do nothing less than completely change the way we design grid-based user interfaces.",
            "CSS has always been used to lay out our web pages, but it's never done a very good job of it.",
            "First we used tables, then floats, positioning and inline-block, but all of these methods were essentially hacks and left out a lot of important functionality (vertical centering, for instance).",
            "Flexbox helped out, but it's intended for simpler one-dimensional layouts, not complex two-dimensional ones (Flexbox and Grid actually work very well together)."
        ]
    },
    "flex-grid": {
        "heading": "FlexBox vs Grid",
        "description": [
            "The box model in CSS gave designers a native way to treat HTML elements, using height and width, padding, borders, and margins.",
            "This enabled them to define space between elements and add treatment to them with borders. Fixed column heights and the float and clear properties then allowed you to align these boxes and/or stack them in columns, either on their own or within a box container. But, this was a lot of work and a bit of a hack.",
            "To make this easier, CSS3 launched a new and improved native layout mode: Flexbox.",
            "This improved on the box model by giving designers more control over the layout without needing to use floats and clears.",
            "In Flex, you can flow elements in either rows or columns (but not both simultaneously) by creating flex containers and within those, flex items."
        ]
    }
}
